notes/leetcode_788_rotated_digits.org
:PROPERTIES:
:ID:       5947D4EE-1CDA-4718-8EE9-3FE9979C986F
:END:
#+TITLE: Leetcode: 788. Rotated Digits

For each possible number, if its digits is $3, 4$ or $7$ then it is invalid and it is will be different if has at least one $2,5,6$ or $9$.

- Time complexity: $O(n \times \log(n))$.
- Space complexity: $O(1)$.

#+begin_src python
  class Solution:
      def rotatedDigits(self, n: int) -> int:
          ans = 0
          for i in range(1, n + 1, 1):
              k = i
              is_different = False
              is_valid = True
              while k > 0 and is_valid:
                  d = k % 10
                  if d in (2, 5, 6, 9):
                      is_different = True
                  if d in (3, 4, 7):
                      is_valid = False
                  k = k // 10
              if is_valid and is_different:
                  ans += 1
          return ans

  assert Solution().rotatedDigits(10) == 4
  assert Solution().rotatedDigits(1) == 0
  assert Solution().rotatedDigits(2) == 1
#+end_src
