leetcode_788_rotated_digits.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Leetcode: 788. Rotated Digits</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><span class="nav-header">Problem Solving</span><span class="nav-items"><a href="index.html">Home</a><span></nav><div id="content" class="content">
<h1 class="title">Leetcode: 788. Rotated Digits</h1>
<p>
For each possible number, if its digits is \(3, 4\) or \(7\) then it is invalid and it is will be different if has at least one \(2,5,6\) or \(9\).
</p>

<ul class="org-ul">
<li>Time complexity: \(O(n \times \log(n))\).</li>
<li>Space complexity: \(O(1)\).</li>
</ul>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">rotatedDigits</span>(<span style="font-weight: bold;">self</span>, n: <span style="font-weight: bold;">int</span>) -&gt; <span style="font-weight: bold;">int</span>:
        ans = 0
        <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(1, n + 1, 1):
            <span style="font-weight: bold; font-style: italic;">k</span> = i
            <span style="font-weight: bold; font-style: italic;">is_different</span> = <span style="font-weight: bold; text-decoration: underline;">False</span>
            <span style="font-weight: bold; font-style: italic;">is_valid</span> = <span style="font-weight: bold; text-decoration: underline;">True</span>
            <span style="font-weight: bold;">while</span> k &gt; 0 <span style="font-weight: bold;">and</span> <span style="font-weight: bold; font-style: italic;">is_valid</span>:
                d = k % 10
                <span style="font-weight: bold;">if</span> d <span style="font-weight: bold;">in</span> (2, 5, 6, 9):
                    <span style="font-weight: bold; font-style: italic;">is_different</span> = <span style="font-weight: bold; text-decoration: underline;">True</span>
                <span style="font-weight: bold;">if</span> d <span style="font-weight: bold;">in</span> (3, 4, 7):
                    <span style="font-weight: bold; font-style: italic;">is_valid</span> = <span style="font-weight: bold; text-decoration: underline;">False</span>
                <span style="font-weight: bold; font-style: italic;">k</span> = k // 10
            <span style="font-weight: bold;">if</span> is_valid <span style="font-weight: bold;">and</span> <span style="font-weight: bold; font-style: italic;">is_different</span>:
                ans += 1
        <span style="font-weight: bold;">return</span> ans

<span style="font-weight: bold;">assert</span> Solution().rotatedDigits(10) == 4
<span style="font-weight: bold;">assert</span> Solution().rotatedDigits(1) == 0
<span style="font-weight: bold;">assert</span> Solution().rotatedDigits(2) == 1
</pre>
</div>


<div id="outline-container-orgadd2eca" class="outline-2">
<h2 id="orgadd2eca">Cited by 1</h2>
<div class="outline-text-2" id="text-orgadd2eca">
<ul class="org-ul">
<li><a href="practice_003.html#ID-014C1068-4C04-4AAD-9FB2-A26033335C34">Practice #003</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>